STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_MultipleConnections_CP/STM32_BLE/App/app_ble.c
/* USER CODE BEGIN Header */
/**
******************************************************************************
* @file    app_ble.c
* @author  GPM WBL Application Team
* @brief   BLE Application
******************************************************************************
* @attention
*
* Copyright (c) 2024 STMicroelectronics.
* All rights reserved.
*
* This software is licensed under terms that can be found in the LICENSE file
* in the root directory of this software component.
* If no LICENSE file comes with this software, it is provided AS-IS.
*
******************************************************************************
*/
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include "main.h"
#include "stm32wb0x.h"
#include "ble.h"
#include "gatt_profile.h"
#include "gap_profile.h"
#include "app_ble.h"
#include "stm32wb0x_hal_radio_timer.h"
#include "bleplat.h"
#include "nvm_db.h"
#include "blenvm.h"
#include "pka_manager.h"
#include "stm32_seq.h"
#include "mc_centralperipheral.h"
#include "mc_centralperipheral_app.h"
#include "gatt_client_app.h"
/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/**
* Security parameters structure
*/
typedef struct
{
  /**
  * IO capability of the device
  */
  uint8_t ioCapability;
  
  /**
  * Authentication requirement of the device
  * Man In the Middle protection required?
  */
  uint8_t mitm_mode;
  
  /**
  * bonding mode of the device
  */
  uint8_t bonding_mode;
  
  /**
  * minimum encryption key size requirement
  */
  uint8_t encryptionKeySizeMin;
  
  /**
  * maximum encryption key size requirement
  */
  uint8_t encryptionKeySizeMax;
  
  /**
  * this flag indicates whether the host has to initiate
  * the security, wait for pairing or does not have any security
  * requirements.
  * 0x00 : no security required
  * 0x01 : host should initiate security by sending the security
  *        request command
  * 0x02 : host need not send the clave security request but it
  * has to wait for paiirng to complete before doing any other
  * processing
  */
  uint8_t initiateSecurity;
  /* USER CODE BEGIN tSecurityParams*/
  
  /* USER CODE END tSecurityParams */
}SecurityParams_t;

/**
* Global context contains all BLE common variables.
*/
typedef struct
{
  /**
  * security requirements of the host
  */
  SecurityParams_t bleSecurityParam;
  
  /**
  * gap service handle
  */
  uint16_t gapServiceHandle;
  
  /**
  * device name characteristic handle
  */
  uint16_t devNameCharHandle;
  
  /**
  * appearance characteristic handle
  */
  uint16_t appearanceCharHandle;
  
  /**
  * connection handle of the current active connection
  * When not in connection, the handle is set to 0xFFFF
  */
  uint16_t connectionHandle;
  /* USER CODE BEGIN BleGlobalContext_t*/
  
  /* USER CODE END BleGlobalContext_t */
}BleGlobalContext_t;

typedef struct
{
  BleGlobalContext_t BleApplicationContext_legacy;
  
  /* To track the status for the Central role */
  APP_BLE_ConnStatus_t Device_Connection_Status_Central;
  
  /* To track the status for the Peripheral role */
  APP_BLE_ConnStatus_t Device_Connection_Status_Peripheral;
  
  /* USER CODE BEGIN PTD_1*/
  
  /* Led Timeout timerID */
  VTIMER_HandleType SwitchOffGPIO_timer_Id;
  
  /* Notification */
  VTIMER_HandleType write_char_timer_Id;
  
  /* Notification */
  VTIMER_HandleType send_notify_timer_Id;
  
  uint8_t connIntervalFlag;
  
  /* Central Role */
  uint8_t deviceServerFound;
  uint8_t deviceServerBdAddrType;
  uint8_t a_deviceServerBdAddr[BD_ADDR_SIZE];
  
  /* USER CODE END PTD_1 */
}BleApplicationContext_t;

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define LED_ON_TIMEOUT_MS              (5)
#define ADV_TIMEOUT_MS                 (60 * 1000)

#define MAX_NUM_BONDED_DEVICES          2U
/* USER CODE END PD */
/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */
/* Private variables ---------------------------------------------------------*/

NO_INIT(uint32_t dyn_alloc_a[BLE_DYN_ALLOC_SIZE>>2]);

static BleApplicationContext_t bleAppContext;

MC_CENTRALPERIPHERAL_APP_ConnHandleNotEvt_t MC_CENTRALPERIPHERALHandleNotification;

GATT_CLIENT_APP_ConnHandle_Notif_evt_t clientHandleNotification;

static const char a_GapDeviceName[] = {  'M', 'u', 'l', 't', 'i', 'C', '_', 'C', 'P' }; /* Gap Device Name */

/**
* Advertising Data
*/
uint8_t a_AdvData[] =
{
  2, AD_TYPE_FLAGS, FLAG_BIT_LE_GENERAL_DISCOVERABLE_MODE|FLAG_BIT_BR_EDR_NOT_SUPPORTED,
  10, AD_TYPE_COMPLETE_LOCAL_NAME, 'm', 'c', '_', 'c', '_', 'p', '_', 'X', 'X',  /* Complete name */
  15, AD_TYPE_MANUFACTURER_SPECIFIC_DATA, 0x30, 0x00, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */, 0x00 /*  */,
};

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/

/* USER CODE BEGIN GV */

/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/
static void connection_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t Role,
                                      uint8_t Peer_Address_Type,
                                      uint8_t Peer_Address[6],
                                      uint16_t Connection_Interval,
                                      uint16_t Peripheral_Latency,
                                      uint16_t Supervision_Timeout);
static void gap_cmd_resp_wait(void);
static void gap_cmd_resp_release(void);

/* USER CODE BEGIN PFP */
static void Adv_Cancel(void);
static void Switch_OFF_GPIO(void *arg);
static void Send_Notify(void *arg);
static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size, const uint8_t*p_bd_addr);
static uint8_t analyse_adv_report(uint8_t adv_data_size, uint8_t *p_adv_data, uint8_t address_type, uint8_t *p_address);
static void Connect_Request(void);
static void Start_Auto_Connection(void);
void Print_Bonded_Devices(void);
uint8_t Get_Num_Bonded_Devices(void);
static void Start_Advertise_Non_Discovery_Mode(void);
static void Write_Char(void *arg);
static void Send_Notify(void *arg);
/* USER CODE END PFP */

