STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_MultipleConnections_CP/STM32_BLE/App/app_ble.c
}

void BLEStack_Process_Schedule(void)
{
  /* Keep BLE Stack Process priority low, since there are limited cases
  where stack wants to be rescheduled for busy waiting.  */
  UTIL_SEQ_SetTask( 1U << CFG_TASK_BLE_STACK, CFG_SEQ_PRIO_1);
}
static void BLEStack_Process(void)
{
  APP_DEBUG_SIGNAL_SET(APP_STACK_PROCESS);
  BLE_STACK_Tick();
  
  APP_DEBUG_SIGNAL_RESET(APP_STACK_PROCESS);
}

void VTimer_Process(void)
{
  HAL_RADIO_TIMER_Tick();
}

void VTimer_Process_Schedule(void)
{
  UTIL_SEQ_SetTask( 1U << CFG_TASK_VTIMER, CFG_SEQ_PRIO_0);
}
void NVM_Process(void)
{
  NVMDB_Tick();
}

void NVM_Process_Schedule(void)
{
  UTIL_SEQ_SetTask( 1U << CFG_TASK_NVM, CFG_SEQ_PRIO_1);
}

/* Function called from RADIO_TIMER_TXRX_WKUP_IRQHandler() context. */
void HAL_RADIO_TIMER_TxRxWakeUpCallback(void)
{
  VTimer_Process_Schedule();
}

/* Function called from RADIO_TIMER_CPU_WKUP_IRQHandler() context. */
void HAL_RADIO_TIMER_CpuWakeUpCallback(void)
{
  VTimer_Process_Schedule();
}

/* Function called from RADIO_TXRX_IRQHandler() context. */
void HAL_RADIO_TxRxCallback(uint32_t flags)
{
  BLE_STACK_RadioHandler(flags);
  
  VTimer_Process_Schedule();
  NVM_Process_Schedule();
}

/* Function called from RADIO_RRM_IRQHandler() context. */
void HAL_RADIO_RRMCallback(uint32_t ble_irq_status)
{
  BLE_STACK_RRMHandler(ble_irq_status);
}

void BLE_STACK_ProcessRequest(void)
{
  BLEStack_Process_Schedule();
}

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  /* USER CODE BEGIN APP_BLE_Init_1 */
  tBleStatus ret;
  /* USER CODE END APP_BLE_Init_1 */
  UTIL_SEQ_RegTask(1U << CFG_TASK_BLE_STACK, UTIL_SEQ_RFU, BLEStack_Process);
  UTIL_SEQ_RegTask(1U << CFG_TASK_VTIMER, UTIL_SEQ_RFU, VTimer_Process);
  UTIL_SEQ_RegTask(1U << CFG_TASK_NVM, UTIL_SEQ_RFU, NVM_Process);
  ModulesInit();
  
  /* Initialization of HCI & GATT & GAP layer */
  BLE_Init();
  
  /**
  * Initialization of the BLE App Context
  */
  bleAppContext.Device_Connection_Status_Central = APP_BLE_IDLE;
  bleAppContext.Device_Connection_Status_Peripheral = APP_BLE_IDLE;
  
  bleAppContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;
  
  /* From here, all initialization are BLE application specific */
  
  /* USER CODE BEGIN APP_BLE_Init_4 */
  
  bleAppContext.connIntervalFlag = 0;
  
  /* For Peripheral */
  UTIL_SEQ_RegTask(1U << CFG_TASK_ADV_CANCEL_ID, UTIL_SEQ_RFU, Adv_Cancel);
  UTIL_SEQ_RegTask(1U << CFG_TASK_START_ADVERTISE_NON_DISCOVERY_MODE, UTIL_SEQ_RFU, Start_Advertise_Non_Discovery_Mode);  
  
  /* Create timer to handle the Led Switch OFF */
  bleAppContext.SwitchOffGPIO_timer_Id.callback = Switch_OFF_GPIO;
  
  bleAppContext.write_char_timer_Id.callback = Write_Char; 
  
  bleAppContext.send_notify_timer_Id.callback = Send_Notify; 
  
  HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.send_notify_timer_Id, SEND_NOTIFY_TIMEOUT_MS);
  
  /* USER CODE END APP_BLE_Init_4 */
  
  /**
  * Initialize Services and Characteristics.
  */
  APP_DBG_MSG("\n");
  APP_DBG_MSG("Services and Characteristics creation\n");
  MC_CENTRALPERIPHERAL_APP_Init();
  APP_DBG_MSG("End of Services and Characteristics creation\n");
  APP_DBG_MSG("\n");
  
  /* USER CODE BEGIN APP_BLE_Init_3 */
  
  ret = aci_hal_set_radio_activity_mask(0x0006);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%2X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
  }
  
  /* USER CODE END APP_BLE_Init_3 */
  
  /**
  * Initialize GATT Client Application
  */
  GATT_CLIENT_APP_Init();
  
  /* USER CODE BEGIN APP_BLE_Init_2 */
  
  /* For Central */
  UTIL_SEQ_RegTask(1U << CFG_TASK_CONNECTION_REQUEST, UTIL_SEQ_RFU, Connect_Request);
  UTIL_SEQ_RegTask(1U << CFG_TASK_AUTO_CONNECTION_REQUEST, UTIL_SEQ_RFU, Start_Auto_Connection);
    

  Start_Advertise_Non_Discovery_Mode();  
  
  Start_Auto_Connection(); 
  /* USER CODE END APP_BLE_Init_2 */
  
  return;
}

void BLEEVT_App_Notification(const hci_pckt *hci_pckt)
{
  tBleStatus ret = BLE_STATUS_ERROR;
  hci_event_pckt    *p_event_pckt;
  hci_le_meta_event *p_meta_evt;
  void *event_data;
  
  UNUSED(ret);
  /* USER CODE BEGIN SVCCTL_App_Notification */
  
  /* USER CODE END SVCCTL_App_Notification */
  
  if(hci_pckt->type != HCI_EVENT_PKT_TYPE && hci_pckt->type != HCI_EVENT_EXT_PKT_TYPE)
  {
    /* Not an event */
    return;
  }
  
  p_event_pckt = (hci_event_pckt*)hci_pckt->data;
  
  if(hci_pckt->type == HCI_EVENT_PKT_TYPE){
    event_data = p_event_pckt->data;
  }
  else { /* hci_pckt->type == HCI_EVENT_EXT_PKT_TYPE */
    hci_event_ext_pckt *p_event_pckt = (hci_event_ext_pckt*)hci_pckt->data;
    event_data = p_event_pckt->data;
  }
  
  switch (p_event_pckt->evt) /* evt field is at same offset in hci_event_pckt and hci_event_ext_pckt */
  {
  case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      hci_disconnection_complete_event_rp0 *p_disconnection_complete_event;
      p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) p_event_pckt->data;
      
      /* USER CODE BEGIN EVT_DISCONN_COMPLETE_3 */
      
      /* USER CODE END EVT_DISCONN_COMPLETE_3 */
      APP_DBG_MSG("\n\n>>== HCI_DISCONNECTION_COMPLETE_EVT_CODE\n");
      APP_DBG_MSG("     - Connection Handle:   0x%02X\n     - Reason:    0x%02X\n",
                  p_disconnection_complete_event->Connection_Handle,
                  p_disconnection_complete_event->Reason);
      gap_cmd_resp_release();
      /* USER CODE BEGIN EVT_DISCONN_COMPLETE_1 */
      
      /* USER CODE END EVT_DISCONN_COMPLETE_1 */
      MC_CENTRALPERIPHERALHandleNotification.EvtOpcode = MC_CENTRALPERIPHERAL_DISCON_HANDLE_EVT;
      MC_CENTRALPERIPHERALHandleNotification.ConnectionHandle = p_disconnection_complete_event->Connection_Handle;
      MC_CENTRALPERIPHERAL_APP_EvtRx(&MC_CENTRALPERIPHERALHandleNotification);
      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

      Start_Advertise_Non_Discovery_Mode();

      /* USER CODE END EVT_DISCONN_COMPLETE */
    }
    break;
    
  case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (hci_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */
      
      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
      case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_update_complete_event_rp0 *p_conn_update_complete;
          p_conn_update_complete = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG("\n\n>>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          APP_DBG_MSG("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                      INT(p_conn_update_complete->Connection_Interval*1.25),
                      FRACTIONAL_2DIGITS(p_conn_update_complete->Connection_Interval*1.25),
                      p_conn_update_complete->Peripheral_Latency,
                      p_conn_update_complete->Supervision_Timeout*10);
          UNUSED(p_conn_update_complete);
          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
        }
        break;
      case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_phy_update_complete_event_rp0 *p_le_phy_update_complete;
          p_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)p_meta_evt->data;
          UNUSED(p_le_phy_update_complete);
          
          gap_cmd_resp_release();
          
          /* USER CODE BEGIN EVT_LE_PHY_UPDATE_COMPLETE */
          
          /* USER CODE END EVT_LE_PHY_UPDATE_COMPLETE */
        }
        break;
      case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_enhanced_connection_complete_event_rp0 *p_enhanced_conn_complete;
          p_enhanced_conn_complete = (hci_le_enhanced_connection_complete_event_rp0 *) p_meta_evt->data;
          
          connection_complete_event(p_enhanced_conn_complete->Status,
                                    p_enhanced_conn_complete->Connection_Handle,
                                    p_enhanced_conn_complete->Role,
                                    p_enhanced_conn_complete->Peer_Address_Type,
                                    p_enhanced_conn_complete->Peer_Address,
                                    p_enhanced_conn_complete->Connection_Interval,
                                    p_enhanced_conn_complete->Peripheral_Latency,
                                    p_enhanced_conn_complete->Supervision_Timeout);

