STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_MultipleConnections_CP/STM32_BLE/App/app_ble.c
          /* USER CODE END ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE*/
        }
        break;
      case ACI_GAP_PASSKEY_REQ_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GAP_PASSKEY_REQ_VSEVT_CODE\n");
          
          ret = aci_gap_passkey_resp(bleAppContext.BleApplicationContext_legacy.connectionHandle, CFG_FIXED_PIN);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_passkey_resp : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_passkey_resp : Success\n");
          }
          /* USER CODE BEGIN ACI_GAP_PASSKEY_REQ_VSEVT_CODE*/
          
          APP_DBG_MSG(">>== aci_gap_passkey_resp connectionHandle=0x%04X\n", bleAppContext.BleApplicationContext_legacy.connectionHandle);
          /* USER CODE END ACI_GAP_PASSKEY_REQ_VSEVT_CODE*/
        }
        break;
      case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE:
        {
          uint8_t confirm_value;
          APP_DBG_MSG(">>== ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE\n");
          APP_DBG_MSG("     - numeric_value = %d\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          APP_DBG_MSG("     - Hex_value = %x\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          
          /* Set confirm value to 1(YES) */
          confirm_value = 1;
          /* USER CODE BEGIN ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE_0*/
          
          APP_DBG_MSG(">>== aci_gap_numeric_comparison_value_confirm_yesno connectionHandle=0x%04X\n", bleAppContext.BleApplicationContext_legacy.connectionHandle);
          /* USER CODE END ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE_0*/
          
          ret = aci_gap_numeric_comparison_value_confirm_yesno(bleAppContext.BleApplicationContext_legacy.connectionHandle, confirm_value);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_numeric_comparison_value_confirm_yesno : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_numeric_comparison_value_confirm_yesno : Success\n");
          }
          /* USER CODE BEGIN ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE*/
          
          /* USER CODE END ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE*/
        }
        break;
      case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE\n");
          aci_gap_pairing_complete_event_rp0 *p_pairing_complete;
          p_pairing_complete = (aci_gap_pairing_complete_event_rp0*)p_blecore_evt->data;
          
          if (p_pairing_complete->Status != 0)
          {
            APP_DBG_MSG("     - Pairing KO\n     - Status: 0x%02X\n     - Reason: 0x%02X\n",
                        p_pairing_complete->Status, p_pairing_complete->Reason);
          }
          else
          {
            APP_DBG_MSG("     - Pairing Success\n");
          }
          APP_DBG_MSG("\n");
          
          /* USER CODE BEGIN ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/
          
          APP_DBG_MSG(">>== ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE connectionHandle=0x%04X\n", p_pairing_complete->Connection_Handle);
          
          /* 0x03 : Encryption failed, LTK missing on local device */
          if (p_pairing_complete->Status == 0x03)
          {    
            /*
            * 0x03 Encryption failed, LTK missing on local device
            * Description of the Pairing Process and Handling Pairing Failures 0x03
            *
            * 1. Peripheral in advertising general discovery:
            *    - The peripheral device starts broadcasting advertising packets to be discovered by central devices.
            *
            * 2. Pairing complete + bonding:
            *    - The pairing process is successfully completed, and the devices store the security keys (bonding).
            *
            * 3. Disconnection (central or peripheral):
            *    - The connection between the central and peripheral device is terminated.
            *
            * 4. Peripheral clears the security DB:
            *    - The peripheral device clears its security database, removing all stored pairing keys.
            *
            * 5. Peripheral in advertising general discovery:
            *    - The peripheral device goes back to advertising mode to be discovered again.
            *
            * 6. The same central that was successfully bonded tries to auto-connect to the peripheral:
            *    - The central device, which still has the stored pairing keys, attempts to automatically reconnect to the peripheral.
            *
            * 7. The central device, which still has the stored pairing keys, attempts to automatically reconnect to the peripheral:
            *    - The connection between the central and peripheral device is re-established.
            *
            * 8. The connection is established:
            *    - The connection between the central and peripheral device is re-established.
            *
            * 9. Pairing KO with Status: 0x03 (Encryption failed, LTK missing on local device) Reason: 0x00:
            *    - The pairing process fails because the peripheral device no longer has the Long Term Key (LTK) required for encryption, while the central device still believes it is bonded.
            *
            * @brief What to do in case of pairing KO:
            *
            * 10. When a pairing failure with status 0x03 (Encryption failed, LTK missing on local device) is detected:
            *     - The central device should clear its security database and retry the pairing process.
            *
            * In this section of the code, we should clear only the obsolete keys using the aci_gap_remove_bonded_device function to ensure that outdated bonding information is removed from the device.
            */
            ret = aci_gap_clear_security_db();
            if (ret != BLE_STATUS_SUCCESS)
            {
              APP_DBG_MSG("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
            }
            else
            {
              APP_DBG_MSG("==>> aci_gap_clear_security_db - Success\n");
            }
            
