STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_MultipleConnections_CP/STM32_BLE/App/app_ble.c
            MC_CENTRALPERIPHERALHandleNotification.EvtOpcode = MC_CENTRALPERIPHERAL_PAIRING_ERROR_HANDLE_EVT;
            MC_CENTRALPERIPHERALHandleNotification.ConnectionHandle = p_pairing_complete->Connection_Handle;
            MC_CENTRALPERIPHERAL_APP_EvtRx(&MC_CENTRALPERIPHERALHandleNotification);
            

            UTIL_SEQ_SetTask( 1U << CFG_TASK_PERIPHERAL_SECURITY_REQUEST, CFG_SEQ_PRIO_0);
            
          } /* END p_pairing_complete->Status == 0x03 */
          
          
          
          /* At pairing completion, I can start the advertising again in auto connection mode with a filter. 
          * Please note that by deciding to put this restart here, we must use the pairing for our connection. 
          * To ensure that this advertising starts every time, even when the central device fails to pair due 
          * to some error, a timer must be created and linked with the action to restart the advertising. 
          * Pairing KO due to the timeout is included in the covered restart advertising.
          */
          
          APP_DBG_MSG(">>== ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE connectionHandle=0x%04X\n", p_pairing_complete->Connection_Handle);
          MC_CENTRALPERIPHERALHandleNotification.EvtOpcode = MC_CENTRALPERIPHERAL_PAIRING_SUCCESS_HANDLE_EVT;
          MC_CENTRALPERIPHERALHandleNotification.ConnectionHandle = p_pairing_complete->Connection_Handle;
          MC_CENTRALPERIPHERAL_APP_EvtRx(&MC_CENTRALPERIPHERALHandleNotification);
          
          
          /* USER CODE END ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/
        }
        break;
      case ACI_GATT_SRV_READ_VSEVT_CODE :
        {
          APP_DBG_MSG(">>== ACI_GATT_SRV_READ_VSEVT_CODE\n");
          
          aci_gatt_srv_read_event_rp0    *p_read;
          p_read = (aci_gatt_srv_read_event_rp0*)p_blecore_evt->data;
          uint8_t error_code = BLE_ATT_ERR_INSUFF_AUTHORIZATION;
          
          APP_DBG_MSG("Handle 0x%04X\n",  p_read->Attribute_Handle);
          
          /* USER CODE BEGIN ACI_GATT_SRV_READ_VSEVT_CODE_1*/
          
          /* USER CODE END ACI_GATT_SRV_READ_VSEVT_CODE_1*/
          
          aci_gatt_srv_resp(p_read->Connection_Handle,
                            p_read->CID,
                            p_read->Attribute_Handle,
                            error_code,
                            0,
                            NULL);
          
          /* USER CODE BEGIN ACI_GATT_SRV_READ_VSEVT_CODE_2*/
          
          /* USER CODE END ACI_GATT_SRV_READ_VSEVT_CODE_2*/
          break;
        }
        /* USER CODE BEGIN EVT_VENDOR_1 */
        
        /* USER CODE END EVT_VENDOR_1 */
      default:
        /* USER CODE BEGIN EVT_VENDOR_DEFAULT */
        APP_DBG_MSG("HCI_VENDOR_EVT: 0x%04X\n", p_blecore_evt->ecode);
        /* USER CODE END EVT_VENDOR_DEFAULT */
        break;
      }
    } /* HCI_VENDOR_EVT_CODE */
    break;
    
  case HCI_HARDWARE_ERROR_EVT_CODE:
    {
      hci_hardware_error_event_rp0 *p_hci_hardware_error_event;
      p_hci_hardware_error_event = (hci_hardware_error_event_rp0*)p_event_pckt->data;
      
      if (p_hci_hardware_error_event->Hardware_Code <= 0x03)
      {
        NVIC_SystemReset();
      }
    }
    break;
    
    /* USER CODE BEGIN EVENT_PCKT */
    
    /* USER CODE END EVENT_PCKT */
    
  default:
    /* USER CODE BEGIN ECODE_DEFAULT*/
    APP_DBG_MSG("HCI_EVENT: 0x%02X\n", p_event_pckt->evt);
    /* USER CODE END ECODE_DEFAULT*/
    break;
  }
}

static void connection_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t Role,
                                      uint8_t Peer_Address_Type,
                                      uint8_t Peer_Address[6],
                                      uint16_t Conn_Interval,
                                      uint16_t Peripheral_Latency,
                                      uint16_t Supervision_Timeout)
{
  if(Status != 0)
  {
    APP_DBG_MSG("==>> connection_complete_event Fail, Status: 0x%02X\n", Status);
    
    if (Role == HCI_ROLE_PERIPHERAL)
    {
      bleAppContext.Device_Connection_Status_Peripheral = APP_BLE_IDLE;
    }
    else
    {
      bleAppContext.Device_Connection_Status_Central = APP_BLE_IDLE;
    }
    return;
  }
  /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE_1 */
  if (Role == HCI_ROLE_PERIPHERAL)
  {
    APP_DBG_MSG(">>== hci_le_connection_complete_event - Role: HCI_ROLE_PERIPHERAL\n");
  }
  else
  {
    APP_DBG_MSG(">>== hci_le_connection_complete_event - Role: HCI_ROLE_CENTRAL\n");
  }
  /* USER CODE END HCI_EVT_LE_CONN_COMPLETE_1 */
  APP_DBG_MSG(">>== hci_le_connection_complete_event - Connection handle: 0x%04X\n", Connection_Handle);
  APP_DBG_MSG("     - Connection established with @:%02X:%02X:%02X:%02X:%02X:%02X\n",
              Peer_Address[5],
              Peer_Address[4],
              Peer_Address[3],
              Peer_Address[2],
              Peer_Address[1],
              Peer_Address[0]);
  APP_DBG_MSG("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n",
              INT(Conn_Interval*1.25),
              FRACTIONAL_2DIGITS(Conn_Interval*1.25),
              Peripheral_Latency,
              Supervision_Timeout * 10
                );
  
  bleAppContext.BleApplicationContext_legacy.connectionHandle = Connection_Handle;
  
  if (Role == HCI_ROLE_PERIPHERAL)
  {
    MC_CENTRALPERIPHERALHandleNotification.EvtOpcode = MC_CENTRALPERIPHERAL_PERIPH_CONN_HANDLE_EVT;
  }
  else /* HCI_ROLE_CENTRAL */
  {
    MC_CENTRALPERIPHERALHandleNotification.EvtOpcode = MC_CENTRALPERIPHERAL_CENTR_CONN_HANDLE_EVT;
  }
  
  MC_CENTRALPERIPHERALHandleNotification.ConnectionHandle = Connection_Handle;
  
  MC_CENTRALPERIPHERAL_APP_EvtRx(&MC_CENTRALPERIPHERALHandleNotification);
  
  /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */
  if (Role == HCI_ROLE_PERIPHERAL)
  { 
    /* Connection as Peripheral */
    bleAppContext.Device_Connection_Status_Peripheral = APP_BLE_CONNECTED_SERVER;
    

    UTIL_SEQ_SetTask(1U << CFG_TASK_PERIPHERAL_SECURITY_REQUEST, CFG_SEQ_PRIO_0);
  }
  else
  {
    APP_DBG_MSG(">>== hci_le_connection_complete_event - Role: HCI_ROLE_CENTRAL\n");
    if (bleAppContext.Device_Connection_Status_Central == APP_BLE_LP_CONNECTING || bleAppContext.Device_Connection_Status_Central == APP_BLE_LP_CONNECTING_AUTO_CONNECTION)
    {
      /* Connection as Central */
      bleAppContext.Device_Connection_Status_Central = APP_BLE_CONNECTED_CLIENT;
      
      APP_DBG_MSG("HCI_EVT_LE_CONN_COMPLETE \n");
      
      GATT_CLIENT_APP_Discover_services(Connection_Handle);
      
      /* Ste the event CFG_IDLEEVT_CONNECTION_COMPLETE for the Connect_Request() function. */
      APP_DBG_MSG("Ste the event CFG_IDLEEVT_CONNECTION_COMPLETE for the Connect_Request() function.\n");
      UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_CONNECTION_COMPLETE);
    }
  }
  /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
}/* end hci_le_connection_complete_event() */

