STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_MultipleConnections_CP/STM32_BLE/App/app_ble.c
static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}
/* USER CODE BEGIN FD_LOCAL_FUNCTION */


/**
* @brief Switch off the GPIO (LED).
*
* This function turns off the green LED.
*
* @param arg Pointer to the argument (not used in this function).
*/
static void Switch_OFF_GPIO(void *arg)
{
  BSP_LED_Off(LED_GREEN);
  return;
}

/**
* @brief Cancel the advertising process.
*
* This function stops the advertising process and updates the device connection
* status to idle. It also turns off the green LED to indicate that advertising
* has been stopped.
*
* @note This function is specific to CFG_TASK_ADV_CANCEL_ID.
*/
static void Adv_Cancel(void)
{
  BSP_LED_Off(LED_GREEN);
  APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
  bleAppContext.Device_Connection_Status_Peripheral = APP_BLE_IDLE; 
  return;
}


static void Start_Advertise_Non_Discovery_Mode(void)
{
  uint8_t status = 0;
  Advertising_Set_Parameters_t Advertising_Set_Parameters = {0};
  
  if(bleAppContext.Device_Connection_Status_Peripheral == APP_BLE_ADV_FAST_NON_DISC_WITH_FILTER)
  {
    return;
  }    
  
  if(bleAppContext.Device_Connection_Status_Peripheral == APP_BLE_ADV_FAST || bleAppContext.Device_Connection_Status_Peripheral == APP_BLE_ADV_LP)
  {
    return;
  }
    
  /* Configure advertising for filtering */
    status = aci_gap_set_advertising_configuration(0,
                                                         GAP_MODE_NON_DISCOVERABLE,
                                                         ADV_TYPE,
                                                         ADV_INTERVAL_MIN,
                                                         ADV_INTERVAL_MAX,
                                                         HCI_ADV_CH_ALL,
                                                         0,
                                                         NULL, /* No peer address */
                                                         HCI_ADV_FILTER_ACCEPT_LIST_SCAN_CONNECT,
                                                         0, /* 0 dBm */
                                                         HCI_PHY_LE_1M, /* Primary advertising PHY */
                                                         0, /* 0 skips */
                                                         HCI_PHY_LE_1M, /* Secondary advertising PHY. Not used with legacy advertising. */
                                                         0, /* SID */
                                                         0 /* No scan request notifications */);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_set_advertising_configuration (GAP_MODE_NON_DISCOVERABLE) - fail, result: 0x%02X\n", status);
    return;
  }
  else
  {
    bleAppContext.Device_Connection_Status_Peripheral = APP_BLE_ADV_FAST_NON_DISC_WITH_FILTER;
    APP_DBG_MSG("==>> Success: aci_gap_set_advertising_configuration (GAP_MODE_NON_DISCOVERABLE)\n");
  }
  
  /* Set the advertising data */
  a_AdvData[2] = FLAG_BIT_BR_EDR_NOT_SUPPORTED;
  status = aci_gap_set_advertising_data(0, ADV_COMPLETE_DATA, 0x3, (uint8_t*) a_AdvData);
  
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_set_advertising_data Failed (FILTER), result: 0x%02X\n", status);
    return;
  }
  else
  {
    APP_DBG_MSG("==>> Success: aci_gap_set_advertising_data (FILTER)\n");
  }
  
  status = aci_gap_set_advertising_enable(ENABLE, 1, &Advertising_Set_Parameters);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_set_advertising_enable Failed (FILTER), result: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> Success: aci_gap_set_advertising_enable (FILTER)\n");
  }
}


/**
* @brief Fill the advertising data with specific information.
*
* This function fills the advertising data with specific information such as the
* manufacturer-specific data and the complete local name. It also converts parts
* of the Bluetooth device address into ASCII characters and inserts them into the
* advertising data.
*
* @param p_adv_data Pointer to the advertising data array.
* @param tab_size Size of the advertising data array.
* @param p_bd_addr Pointer to the Bluetooth device address.
*/
static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size, const uint8_t* p_bd_addr)
{
  uint16_t i =0;
  uint8_t bd_addr_1, bd_addr_0;
  uint8_t ad_length, ad_type;  
  
  while(i < tab_size)
  {
    ad_length = p_adv_data[i];
    ad_type = p_adv_data[i + 1];
    
    switch (ad_type)
    {
    case AD_TYPE_FLAGS:
      break;
    case AD_TYPE_TX_POWER_LEVEL:
      break;
    case AD_TYPE_COMPLETE_LOCAL_NAME:
      {
        if((p_adv_data[i + ad_length] == 'X') && (p_adv_data[i + ad_length - 1] == 'X'))
        {
          bd_addr_1 = ((p_bd_addr[0] & 0xF0)>>4);
          bd_addr_0 = (p_bd_addr[0] & 0xF);
          
          /* Convert hex value into ascii */
          if(bd_addr_1 > 0x09)
          {
            p_adv_data[i + ad_length - 1] = bd_addr_1 + '7';
          }
          else
          {
            p_adv_data[i + ad_length - 1] = bd_addr_1 + '0';
          }
          
          if(bd_addr_0 > 0x09)
          {
            p_adv_data[i + ad_length] = bd_addr_0 + '7';
          }
          else
          {
            p_adv_data[i + ad_length] = bd_addr_0 + '0';
          }
        }
        break;
      }
    case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
      {
        p_adv_data[i+2] = ST_MANUF_ID_LSB;
        p_adv_data[i+3] = ST_MANUF_ID_MSB;
        p_adv_data[i+4] = BLUESTSDK_V2; /* blueST SDK version */
        p_adv_data[i+5] = BOARD_ID_NUCLEO_WB0; /* Board ID */
        p_adv_data[i+6] = FW_ID_MC_CENTRALPERIPHERAL; /* FW ID */
        p_adv_data[i+7] = FW_ID_MC_CENTRALPERIPHERAL_D1; /* FW data 1 */
        p_adv_data[i+8] = FW_ID_MC_CENTRALPERIPHERAL_D2; /* FW data 2 */
        p_adv_data[i+9] = FW_ID_MC_CENTRALPERIPHERAL_D3; /* FW data 3 */
        p_adv_data[i+10] = p_bd_addr[5]; /* MSB BD address */
        p_adv_data[i+11] = p_bd_addr[4];
        p_adv_data[i+12] = p_bd_addr[3];
        p_adv_data[i+13] = p_bd_addr[2];
        p_adv_data[i+14] = p_bd_addr[1];
        p_adv_data[i+15] = p_bd_addr[0]; /* LSB BD address */
        break;
      }
    default:
      break;
    }
    i += ad_length + 1; /* increment the iterator to go on next element*/
  }
}

/**
* @brief Analyse the advertising report to find a specific peripheral.
*
* This function parses the advertising data to identify a specific peripheral
* based on manufacturer-specific data. If the peripheral is found, its address
* and address type are stored in the application context.
*
* @param adv_data_size Size of the advertising data.
* @param p_adv_data Pointer to the advertising data.
* @param address_type Type of the address (public or random).
* @param p_address Pointer to the address of the advertising device.
* @return uint8_t Returns 1 if the specific peripheral is found, otherwise 0.
*/
static uint8_t analyse_adv_report(uint8_t adv_data_size, uint8_t *p_adv_data,
                                  uint8_t address_type, uint8_t *p_address)
{
  uint8_t found_status = 0;
  uint16_t i = 0;
  uint8_t ad_length, ad_type;
  
  while(i < adv_data_size)
  {
    ad_length = p_adv_data[i];
    ad_type = p_adv_data[i + 1];
    
    switch (ad_type)
    {
    case AD_TYPE_FLAGS:
      break;
    case AD_TYPE_TX_POWER_LEVEL:
      break;
    case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
      {
        if ((ad_length >= 7)                              && 
            (p_adv_data[i + 2] == ST_MANUF_ID_LSB)        &&
              (p_adv_data[i + 3] == ST_MANUF_ID_MSB)        &&
                (p_adv_data[i + 4] == BLUESTSDK_V2)           &&
                  (p_adv_data[i + 6] == FW_ID_MC_PERIPHERAL)    &&
                    (p_adv_data[i + 7] == FW_ID_MC_PERIPHERAL_D1) &&
                      (p_adv_data[i + 8] == FW_ID_MC_PERIPHERAL_D2) &&
                        (p_adv_data[i + 9] == FW_ID_MC_PERIPHERAL_D3))
        {
          
