STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_MultipleConnections_CP/STM32_BLE/App/app_ble.c
          /* 
          BLE_MultipleConnections_
          Note: The BLE_MultipleConnections_Central device can connect with a BLE_MultipleConnections_CP device. 
          Similarly, a BLE_MultipleConnections_Peripheral device can connect with a BLE_MultipleConnections_CP device. 
          However, a BLE_MultipleConnections_Central device is not designed in this example to connect with a BLE_MultipleConnections_Peripheral device. */
          
          /* Peripheral BlueST v2 detected */
          bleAppContext.deviceServerBdAddrType = address_type;
          memcpy(bleAppContext.a_deviceServerBdAddr, p_address, BD_ADDR_SIZE);
          
          bleAppContext.deviceServerFound = 0x01;
          
          APP_DBG_MSG("  Peripheral, db addr 0x%02X:%02X:%02X:%02X:%02X:%02X\n",
                      bleAppContext.a_deviceServerBdAddr[5],
                      bleAppContext.a_deviceServerBdAddr[4],
                      bleAppContext.a_deviceServerBdAddr[3],
                      bleAppContext.a_deviceServerBdAddr[2],
                      bleAppContext.a_deviceServerBdAddr[1],
                      bleAppContext.a_deviceServerBdAddr[0]);
          found_status = 1;
        }
        break;
      }
    default:
      break;
    }/* end of switch*/
    
    i += ad_length + 1; /* increment the iterator to go on next element*/
    
    if (found_status != 0)
    {
      break;
    }
  }/* end of while*/
  
  return found_status;
}


/**
* @brief Initiate a connection request to a discovered BLE peripheral.
*
* This function attempts to create a connection to a discovered BLE peripheral device.
* It first sets the connection configuration and then attempts to create the connection.
* If the connection is successfully created, the connection handle is set.
*
* @note This function is specific to CFG_TASK_CONNECTION_REQUEST.
*/
static void Connect_Request(void)
{
  tBleStatus result;
  APP_DBG_MSG("Connect_Request() begin\n");
  
  if (bleAppContext.deviceServerFound != 0)
  {
    
    bleAppContext.deviceServerFound = 0x00;
    
    APP_DBG_MSG("Create connection to Peripheral\n");
    
    result = aci_gap_set_connection_configuration(LE_1M_PHY_BIT,
                                                  CONN_INT_MS(50u), CONN_INT_MS(100u),
                                                  0u,
                                                  CONN_SUP_TIMEOUT_MS(5000u),
                                                  CONN_CE_LENGTH_MS(10u), CONN_CE_LENGTH_MS(10u));
    
    if (result == BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_connection_configuration Success , result: 0x%02X\n", result);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_connection_configuration Failed , result: 0x%02X\n", result);
    }  
    result = aci_gap_create_connection(LE_1M_PHY_BIT,
                                       bleAppContext.deviceServerBdAddrType,
                                       &bleAppContext.a_deviceServerBdAddr[0]);    
    if (result == BLE_STATUS_SUCCESS)
    {
      bleAppContext.Device_Connection_Status_Central = APP_BLE_LP_CONNECTING;
      APP_DBG_MSG("  wait for event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
      UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_CONNECTION_COMPLETE);
      APP_DBG_MSG("  received event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
      bleAppContext.Device_Connection_Status_Central = APP_BLE_IDLE;
    }
    else
    {
      APP_DBG_MSG("==>> GAP Create connection Failed , result: 0x%02X\n", result);
      bleAppContext.Device_Connection_Status_Central = APP_BLE_IDLE;
    }
  }
  else
  {
    APP_DBG_MSG("--Connect_Request() Device Server Not Found\n");
    bleAppContext.Device_Connection_Status_Central = APP_BLE_IDLE;
  }
  
  APP_DBG_MSG("--Connect_Request() end \n");
  return;
}



static void Start_Auto_Connection(void)
{  
  /* Check if there are any bonded devices */
  if (Get_Num_Bonded_Devices() == 0)
  {
    APP_DBG_MSG("No bonded device found - No Start_Auto_Connection started.\n");
    return;
  }

uint32_t status, paramA = SCAN_INT_MS(500), paramB = SCAN_WIN_MS(250);
  
  if (bleAppContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode)
  {
    status = aci_gap_configure_filter_accept_and_resolving_list(0x01);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : (FILTER) aci_gap_configure_filter_accept_and_resolving_list command, result: 0x%02X\n", status);
    }
    else
    {
      APP_DBG_MSG("  Success: (FILTER) aci_gap_configure_filter_accept_and_resolving_list command\n");
    }
  }
  
  status = aci_gap_set_scan_configuration(DUPLICATE_FILTER_ENABLED, 0x00, LE_1M_PHY_BIT, HCI_SCAN_TYPE_ACTIVE, paramA, paramB);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("(FILTER) aci_gap_set_scan_configuration - fail, result: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> (FILTER) aci_gap_set_scan_configuration - Success\n");
  }
  
  status = aci_gap_set_connection_configuration(LE_1M_PHY_BIT,
                                                CONN_INT_MS(50u), 
                                                CONN_INT_MS(100u),
                                                0u,
                                                CONN_SUP_TIMEOUT_MS(5000u),
                                                CONN_CE_LENGTH_MS(10u), 
                                                CONN_CE_LENGTH_MS(10u));
  
  if (status == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> (FILTER) aci_gap_set_connection_configuration Success , result: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> (FILTER) aci_gap_set_connection_configuration Failed , result: 0x%02X\n", status);
  }  
  
  /* Start the auto connection establishment procedure */
  status = aci_gap_start_procedure(GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC, LE_1M_PHY_BIT, 0, 0);
  
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("(FILTER) aci_gap_start_procedure GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - fail, result: 0x%02X\n", status);
  }
  else
  {
    bleAppContext.Device_Connection_Status_Central = APP_BLE_LP_CONNECTING_AUTO_CONNECTION;
    APP_DBG_MSG("==>> (FILTER) aci_gap_start_procedure GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - Success\n");
  }

  if(bleAppContext.Device_Connection_Status_Central == APP_BLE_IDLE)
  {
    APP_DBG_MSG("==>> Start_Auto_Connection - Loop restart\n");
    Start_Auto_Connection();
  }
  
  
  return;
}


/**
* @brief  Prints the list of bonded devices.
* 
* This function retrieves and prints the list of bonded devices. It iterates through all bonded devices
* and prints their address type and address. If no bonded devices are found, it prints a message indicating
* that there are no bonded devices.
* 
* @retval None
*/
void Print_Bonded_Devices(void)
{
  Bonded_Device_Entry_t bonded_device;
  uint8_t num_returned_devices;
  uint8_t num_bonded_devices = 0;
  
  APP_DBG_MSG("Bonded devices:\n");
  
  for(int i = 0;; i++) {  
    aci_gap_get_bonded_devices(i, 1, &num_returned_devices, &bonded_device);
    
    if(num_returned_devices)
    {
      APP_DBG_MSG("Type %d, @:%02X:%02X:%02X:%02X:%02X:%02X\n", bonded_device.Address_Type, bonded_device.Address[5], bonded_device.Address[4], bonded_device.Address[3], bonded_device.Address[2], bonded_device.Address[1], bonded_device.Address[0]);
    }
    else {
      break;
    }    
    num_bonded_devices += num_returned_devices;    
  }
  
  if(num_bonded_devices == 0){
    
    APP_DBG_MSG("No bonded devices.\n");
  }
}


static void Write_Char(void *arg)
{ 
  if(APP_Context_getActiveConnectionCountCentral() > 0)
  {
    UTIL_SEQ_SetTask( 1U << CFG_TASK_WRITE_ALL_CHAR_ID, CFG_SEQ_PRIO_0);
  }
  HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.send_notify_timer_Id, WRITE_CHAR_TIMEOUT_MS);
}

static void Send_Notify(void *arg)
{
  if(APP_Context_getActiveConnectionCountPeripheral() > 0)
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_SEND_NOTIF_ID, CFG_SEQ_PRIO_0);
  }
  HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.write_char_timer_Id, SEND_NOTIFY_TIMEOUT_MS);
}

/**
* @brief  Retrieves the number of bonded devices.
* 
* This function iterates through all bonded devices and counts the total number of bonded devices.
* 
* @retval uint8_t  The total number of bonded devices.
*/
uint8_t Get_Num_Bonded_Devices(void)
{
  Bonded_Device_Entry_t bonded_device;
  uint8_t num_returned_devices;
  uint8_t num_bonded_devices = 0;
  
  for(int i = 0;; i++) {  
    aci_gap_get_bonded_devices(i, 1, &num_returned_devices, &bonded_device);
    
