STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_MultipleConnections_CP/STM32_BLE/App/app_ble.c
    if(num_returned_devices == 0){
      break;
    }
    num_bonded_devices += num_returned_devices;    
  }
  
  return num_bonded_devices;
}

/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */



#if (CFG_BUTTON_SUPPORTED == 1)


void APPE_Button1Action(void)
{
  /* Check if there are available slots to start advertising. If the maximum number of central connections is reached, print a message and exit. */
  if(APP_Context_canStartAdvertising() == -1)
  {
    APP_DBG_MSG("  Maximum number of Central connections reached. Advertising started in non discoverable mode.\n");
    /* advertising in non discoverable mode */
    Start_Advertise_Non_Discovery_Mode();
    return;
  }
  
  /* If the device is currently advertising in non discoverable mode, stop this advertising to allow starting advertising in general mode. */
  if (bleAppContext.Device_Connection_Status_Peripheral == APP_BLE_ADV_FAST_NON_DISC_WITH_FILTER)
  {
    Adv_Cancel();
  }
  
  /* If advertising is already running, print a message indicating that advertising is already active. */
  if (bleAppContext.Device_Connection_Status_Peripheral == APP_BLE_ADV_FAST || bleAppContext.Device_Connection_Status_Peripheral == APP_BLE_ADV_LP)
  {
    /* Advertising is already running... */
    return;
  }
  
  /* If the device is idle, on connected as a server with at least one radio task free, start advertising in general mode to accept new central connections. Start a timer to stop advertising after a specified timeout period. */
  if (bleAppContext.Device_Connection_Status_Peripheral == APP_BLE_IDLE || bleAppContext.Device_Connection_Status_Peripheral == APP_BLE_CONNECTED_SERVER)
  {
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
    return;
  }
  
  return;
}


void APPE_Button2Action(void)
{
  tBleStatus ret = aci_gap_clear_security_db();
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_clear_security_db - Success\n");
  }
  return;
}

void APPE_Button3Action(void)
{
  UTIL_SEQ_SetTask( 1U << CFG_TASK_TERMINATE_ALL_PERIPHERAL_CONNECTIONS, CFG_SEQ_PRIO_0);
  return;
}


void APPE_Button1LongPressAction(void)
{
  /* TASK_BUTTON_1_LONG_PRESS */
  /* Check if there are available slots to start scanning. If the maximum number of connections (as Central) is reached, print a message and exit. */
  if(APP_Context_canStartScanning() == -1)
  {
    APP_DBG_MSG("  Maximum number of connections (with the role of Central) reached. Scanning cannot be started.\n");
    return;
  }
  if(bleAppContext.Device_Connection_Status_Central == APP_BLE_LP_CONNECTING_AUTO_CONNECTION)
  {
    APP_DBG_MSG("APP_BLE_LP_CONNECTING_AUTO_CONNECTION is running\n");
    
    uint8_t status = aci_gap_terminate_proc(GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("aci_gap_terminate_gap_proc - GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - fail, result: 0x%02X\n",status);
    }
    else
    {
      bleAppContext.Device_Connection_Status_Central = APP_BLE_IDLE;
      APP_DBG_MSG("==>> aci_gap_terminate_gap_proc - GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - Success\n");
    }
  }
  if (bleAppContext.Device_Connection_Status_Central == APP_BLE_IDLE)
  {
    /* Call the function to start the scan procedure */
    APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_START);
  }
  return;
}

void APPE_Button2LongPressAction(void)
{
  tBleStatus ret = aci_gap_clear_security_db();
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_clear_security_db - Success\n");
  }

  return;
}


void APPE_Button3LongPressAction(void)
{
  UTIL_SEQ_SetTask( 1U << CFG_TASK_TERMINATE_ALL_CENTRAL_CONNECTIONS, CFG_SEQ_PRIO_0);
  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
*/
